benchmarks/epoll_output.txt
Running 20s test @ http://127.0.0.1:10000
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    72.10ms  190.20ms   2.01s    94.2%
    Req/Sec     4.40k     1.95k   11.50k    69.2%
  685000 requests in 20.10s, 1.08GB read
  Socket errors: connect 0, read 0, write 0, timeout 1650
Requests/sec:  34000.00
Transfer/sec:     54.80MB