benchmarks/multithread_output.txt
Running 20s test @ http://127.0.0.1:10000
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    80.12ms  130.45ms   1.85s    94.8%
    Req/Sec     2.05k     1.60k    8.50k    77.5%
  92000 requests in 20.05s, 150.0MB read
  Socket errors: connect 0, read 300, write 0, timeout 1200
Requests/sec:   4600.00
Transfer/sec:      7.48MB